In [1]:
import pandas as pd
import numpy as np

# Merge and Join

In [6]:
left=pd.DataFrame({
    'key':'K0 K1 K2 K3'.split(),
    'A':'A0 A1 A2 A3'.split(),
    'B':'B0 B1 B2 B3'.split()
})

right=pd.DataFrame({
    'key':'K0 K1 K3 K4'.split(),
    'C':'C0 C1 C3 C4'.split(),
    'D':'D0 D1 D3 D4'.split()
})

In [3]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [7]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K3  C3  D3
3  K4  C4  D4

## Merge
menggabungkan 2 dataframe berdasarkan **kolom** tertentu

In [8]:
pd.merge(left,right, on='key')
# secara default innder join
# k2 dan k4 tidak muncul, karena hanya dimiliki salah satu kolom.

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C3  D3

In [9]:
left.merge(right, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K3  A3  B3  C3  D3

In [11]:
pd.merge(left,right,how='left',on='key') #how untuk menentukan cara join
# kalau how=left, maka left join, data akan mengikuti dataframe yang di sebelah kiri
# perhatikan bahwa kolom C dan D berisi Nan di K2, karena dataframe right tidak memiliki K2

  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1   C1   D1
2  K2  A2  B2  NaN  NaN
3  K3  A3  B3   C3   D3

In [12]:
left.merge(right, how='right',on='key') # right join mengikuti dataframe di sebelah kanan
# tidak ada K2, karena dataframe right tidak memiliki nilai K2

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K3   A3   B3  C3  D3
3  K4  NaN  NaN  C4  D4

In [14]:
left.merge(right, how='outer', on='key') # pada outer, semua data dari kiri dan kanan muncul

  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1   C1   D1
2  K2   A2   B2  NaN  NaN
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4

## join()

untuk menggabungkan 2 dataframe berdasarkan *Label Index*

In [17]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [18]:
left

      A   B
key
K0   A0  B0
K1   A1  B1
K2   A2  B2
K3   A3  B3

In [19]:
right

      C   D
key
K0   C0  D0
K1   C1  D1
K3   C3  D3
K4   C4  D4

In [20]:
left.join(right) #tidak bisa pd.join(left,right)
# secara default left join

      A   B    C    D
key
K0   A0  B0   C0   D0
K1   A1  B1   C1   D1
K2   A2  B2  NaN  NaN
K3   A3  B3   C3   D3

In [21]:
left.join(right, how='inner')

      A   B   C   D
key
K0   A0  B0  C0  D0
K1   A1  B1  C1  D1
K3   A3  B3  C3  D3

In [22]:
left.join(right,how='right')

       A    B   C   D
key
K0    A0   B0  C0  D0
K1    A1   B1  C1  D1
K3    A3   B3  C3  D3
K4   NaN  NaN  C4  D4

**merge vs join** kalau ada kolom yang namanya sama

In [24]:
left=pd.DataFrame({
    'key':'K0 K1 K2 K3'.split(),
    'A':'A0 A1 A2 A3'.split(),
    'B':'B0 B1 B2 B3'.split()
})

right=pd.DataFrame({
    'key':'K0 K1 K3 K4'.split(),
    'B':'B0 B1 B3 B4'.split(),
    'D':'D0 D1 D3 D4'.split()
})

In [26]:
display(left,right) #sekarang sama=sama punya kolom B

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

  key   B   D
0  K0  B0  D0
1  K1  B1  D1
2  K3  B3  D3
3  K4  B4  D4

In [31]:
left.merge(right, on='key')

  key   A B_x B_y   D
0  K0  A0  B0  B0  D0
1  K1  A1  B1  B1  D1
2  K3  A3  B3  B3  D3

In [ ]:
left.join('right') # tidak bisa menggabungkan dataframe yang memiliki nama kolom yang sama

# Concatenating
untuk menggabungkan 2 atau lebih dataframe

In [39]:
df1=pd.DataFrame({
    'A':'A0 A1 A2 A3'.split(),
    'B':'B0 B1 B2 B3'.split(),
    'C':'C0 C1 C2 C3'.split(),
    'D':'D0 D1 D2 D3'.split()
})

df2=pd.DataFrame({
    'A':'A4 A5 A6 A7'.split(),
    'B':'B4 B5 B6 B7'.split(),
    'C':'C4 C5 C6 C7'.split(),
    'D':'D4 D5 D6 D7'.split()
})

df3=pd.DataFrame({
    'A':'A8 A9 A10 A11'.split(),
    'B':'B8 B9 B10 B11'.split(),
    'C':'C8 C9 C10 C11'.split(),
    'D':'D8 D9 D10 D11'.split()
})

In [41]:
pd.concat([df1,df2,df3]) #seperti menempelkan beberapa dataframe menjadi 1
#secara default akan menempel ke bawah

     A    B    C    D
0   A0   B0   C0   D0
1   A1   B1   C1   D1
2   A2   B2   C2   D2
3   A3   B3   C3   D3
0   A4   B4   C4   D4
1   A5   B5   C5   D5
2   A6   B6   C6   D6
3   A7   B7   C7   D7
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [43]:
pd.concat([df1,df2,df3],axis=1) #digabung ke samping

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [45]:
df2=pd.DataFrame({
    'A':'A4 A5 A6 A7'.split(),
    'B':'B4 B5 B6 B7'.split(),
    'C':'C4 C5 C6 C7'.split(),
    'E':'E4 E5 E6 E7'.split()}) # hanya df2 yang memiliki kolom E

In [46]:
pd.concat([df1,df2,df3]) #perhatikan indexnya

     A    B    C    D    E
0   A0   B0   C0   D0  NaN
1   A1   B1   C1   D1  NaN
2   A2   B2   C2   D2  NaN
3   A3   B3   C3   D3  NaN
0   A4   B4   C4  NaN   E4
1   A5   B5   C5  NaN   E5
2   A6   B6   C6  NaN   E6
3   A7   B7   C7  NaN   E7
0   A8   B8   C8   D8  NaN
1   A9   B9   C9   D9  NaN
2  A10  B10  C10  D10  NaN
3  A11  B11  C11  D11  NaN

In [49]:
df=pd.DataFrame({'name': ['Raven Bierman', 'Valter Havers', 'Marko Mendell', 'Takahiro Momota','Yahiko Tilemans', 'Dina Rebaine'],
    'gender': ['Female','Male','Male','Male','Male','Female'],
    'hire date': ['2016-12-04','2018-04-13','2018-07-04','2016-11-18','2017-05-26','2015-03-20'],
    'gross salary':[7000000,7000000,15000000,12000000,20000000,15000000],
    'Departement':[1, 1, 2, 2, 3,4]})
df

              name  gender   hire date  gross salary  Departement
0    Raven Bierman  Female  2016-12-04       7000000            1
1    Valter Havers    Male  2018-04-13       7000000            1
2    Marko Mendell    Male  2018-07-04      15000000            2
3  Takahiro Momota    Male  2016-11-18      12000000            2
4  Yahiko Tilemans    Male  2017-05-26      20000000            3
5     Dina Rebaine  Female  2015-03-20      15000000            4

In [51]:
df_code=pd.DataFrame({
    'Code_dept':[1,2,3,4],
    'Departement':'Sales Marketing Operational HR'.split()
})
df_code

   Code_dept  Departement
0          1        Sales
1          2    Marketing
2          3  Operational
3          4           HR

In [54]:
df.merge(df_code, left_on='Departement', right_on='Code_dept').drop(['Departement_x','Code_dept'],axis=1)

              name  gender   hire date  gross salary Departement_y
0    Raven Bierman  Female  2016-12-04       7000000         Sales
1    Valter Havers    Male  2018-04-13       7000000         Sales
2    Marko Mendell    Male  2018-07-04      15000000     Marketing
3  Takahiro Momota    Male  2016-11-18      12000000     Marketing
4  Yahiko Tilemans    Male  2017-05-26      20000000   Operational
5     Dina Rebaine  Female  2015-03-20      15000000            HR

# Apply
untuk mengaplikasikan fungsi terhadap kolom tertentu

In [57]:
df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[111,222,333,444],
    'col4':'abc def ghi xyz'.split()
})
df

   col1  col2 col4
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   444  xyz

In [58]:
def times2(x):
    return x*2

df['col1'].apply(times2) #mengaplikasikan fungsi times 2 terhadap col1

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [59]:
df[['col1','col2']].apply(times2) #mengaplikasikan fungsi times 2 terhadap col1 dan col2

   col1  col2
0     2   222
1     4   444
2     6   666
3     8   888

In [60]:
df['col1'].apply(lambda x: x*2) #bisa pakai lambda sebagai pengganti funsi times2

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [61]:
len(df['col4']) # output adalah jumlah data di col4, padahal ingin melihat panjang string di tiap2 baris di col4

4

In [62]:
df['col4'].apply(len) # sama seperti str.len

0    3
1    3
2    3
3    3
Name: col4, dtype: int64

In [63]:
df['col4'].apply(lambda x: x[0]) #untuk mengambil huruf pertama dari setiap baris di col4
#pemakaian apply biasanya memang untuk pengolahan data string pada dataframe
# karena untuk operasi matematik sudah ada broadcasting di pandas

0    a
1    d
2    g
3    x
Name: col4, dtype: object

In [64]:
df['col2']*2 #broadcasting

0    222
1    444
2    666
3    888
Name: col2, dtype: int64

In [66]:
for i in df['col4']:
    print(i[0]) #apply mirip for loop

a
d
g
x

# Pivot Table
biasanya dipakai untuk merangkum data dalam jumlah besar

In [67]:
data=pd.DataFrame({
    'Kota':'Jakarta Jakarta Jakarta Surabaya Surabaya Surabaya'.split(),
    'Toko':'one two three one two three'.split(),
    'Manager':'Andi Budi Andi Budi Andi Budi'.split(),
    'Penjualan':[1,3,4,2,5,9]
})
data

       Kota   Toko Manager  Penjualan
0   Jakarta    one    Andi          1
1   Jakarta    two    Budi          3
2   Jakarta  three    Andi          4
3  Surabaya    one    Budi          2
4  Surabaya    two    Andi          5
5  Surabaya  three    Budi          9

In [68]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager')
# mengubah bentuk tabel tanpa mengubah isi data

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   2.0
         three   NaN   9.0
         two     5.0   NaN

In [69]:
data.loc[6]=['Surabaya','one','Budi',4]
data #jadi data toko one di kota Surabaya dengan manager Budi ada 2

       Kota   Toko Manager  Penjualan
0   Jakarta    one    Andi          1
1   Jakarta    two    Budi          3
2   Jakarta  three    Andi          4
3  Surabaya    one    Budi          2
4  Surabaya    two    Andi          5
5  Surabaya  three    Budi          9
6  Surabaya    one    Budi          4

In [72]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager') 
# secara default kalau ada data dengan index dan kolom yang sama, 
# maka pivot_table akan memasukkan rata-rata dari semua nilainya sebagai value

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   3.0
         three   NaN   9.0
         two     5.0   NaN

In [73]:
data.pivot_table(values='Penjualan', index=['Kota','Toko'],columns='Manager',aggfunc='sum') 
#kita bisa mengubah value yang ditampilkan oleh pivot_table menggunakan parameter aggfunc
# di sini, pada inedx Surabaya One, dengan manager Budi, yang ditampilkan adalah sum dari kedua nilai

Manager         Andi  Budi
Kota     Toko
Jakarta  one     1.0   NaN
         three   4.0   NaN
         two     NaN   3.0
Surabaya one     NaN   6.0
         three   NaN   9.0
         two     5.0   NaN

# Data Input dan Output

bagaimana cara membaca data untuk dataframe Pandas dan menyimpan dataframe yang telah kita olah.

In [74]:
df=pd.DataFrame({
    'nama':'Andi Budi Caca'.split(),
    'umur':[24,18,20],
    'pekerjaan':'Developer Pelajar Data-Scientist'.split()
})
df

   nama  umur       pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

**CSV**

In [79]:
# menyimpan data dalam bentuk csv
# csv adalah comma separated values, salah satu format data yang sering dipakai untuk menyimpan data tabular

df.to_csv('contoh.csv',index=False) #index=False agar label index tidak tersimpan sebagai kolom tersendiri
#sehingga memunculkan kolom extra saat dibaca
# contoh.csv akan otomatis disimpan di folder tempat file kalian berada

In [80]:
pd.read_csv('contoh.csv') #untuk membaca file yang extentionnya adalah csv

   nama  umur       pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

**Excel**

In [81]:
df.to_excel('contoh.xlsx',sheet_name='halaman 1', index=False)

In [82]:
pd.read_excel('contoh.xlsx') #secara default akan membaca sheet pertama

   nama  umur       pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

**JSON**  
JavaScript Object Notation: format data berupa teks ringan dan dapat diubah  
Penulisan JSON sangan mirip dengan dictionary pada python

In [83]:
df.to_json('contoh.json', orient='records') #orient, cara penulisan data di json, apakat per baris atau per kolom

In [86]:
pd.read_json('contoh.json')

   nama  umur       pekerjaan
0  Andi    24       Developer
1  Budi    18         Pelajar
2  Caca    20  Data-Scientist

**HTML**

In [97]:
# kalau kalian tertarik dengan webscrapping, bisa cek library beautifulsoup
pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_deaths')[5].T

,0,1,2,3,4,5,6,7,8,9,...,228,229,230,231,232,233,234,235,236,237
"Countries, areas",World,United States *,Brazil *,India *,Mexico *,Russia *,Peru *,Indonesia *,United Kingdom *,Italy *,...,Saint Helena *,Saint Pierre and Miquelon *,Samoa *,Sint Eustatius *,Solomon Islands *,Tokelau *,Tonga *,Turkmenistan *,Tuvalu *,Vanuatu *
Jan 1,1925656,366491,193875,148994,148494,57555,93192,22329,73512,74159,...,0,0,0,0,0,0,0,0,0,0
Feb 1,2358544,469409,223945,154392,186843,73619,103396,30277,106158,88516,...,0,0,0,0,0,0,0,0,0,0
Mar 1,2657997,529966,254221,157157,210431,86455,121940,36325,122849,97699,...,0,0,0,0,0,0,0,0,0,0
Apr 1,2938648,558122,317646,162927,223407,99233,142864,41054,126713,109346,...,0,0,0,0,0,0,0,0,0,0
May 1,3305818,577087,401186,211853,230859,110520,166382,45652,127517,120807,...,0,0,0,0,0,0,0,0,0,0
Jun 1,3680696,592657,461931,331895,234706,121873,183879,50723,127782,126128,...,0,0,0,0,0,0,0,0,0,0
Jul 1,3954287,601446,515985,399459,237623,135886,192331,58995,128140,127566,...,0,0,0,0,0,0,0,0,0,0
Aug 1,4228358,610469,555460,424351,245354,159352,196291,95723,129654,128063,...,0,0,0,0,0,0,0,0,0,0
Sep 1,4535931,643496,579574,439020,266098,184014,198263,133676,132535,129221,...,0,0,0,0,0,0,0,0,0,0
Oct 1,4791457,696682,596122,448339,281100,208142,199367,142026,136662,130921,...,0,0,0,1,0,0,0,0,0,0
Nov 1,4999157,739856,607694,458437,288276,239693,200217,143423,140632,132100,...,0,0,0,0,0,0,0,0,0,0